import pandas as pd
import matplotlib.pyplot as plt
from numpy import sin, exp, pi, linspace
values_func = pd.read_csv("work1.csv", header=None)

def func(x):
  return exp(sin(x))

iks = [0, 0.333333, 0.666667, 1, 1.33333, 1.66667, 2, 2.33333, 2.66667, 3, 3.33333, 3.66667, 4, 4.33333, 4.66667, 5, 5.33333, 5.66667, 6, 6.33333, 6.66667, 7, 7.33333, 7.66667, 8, 8.33333, 8.66667, 9, 9.33333, 9.66667, 10]
igrek = [1, 1.38707, 1.8559, 2.31978, 2.64306, 2.70583, 2.48258, 2.06078, 1.57976, 1.15156, 0.826489, 0.605757, 0.469164, 0.394943, 0.368264, 0.383305, 0.443379, 0.560908, 0.756226, 1.0514, 1.45376, 1.92897, 2.38094, 2.67115, 2.68951, 2.42855, 1.98884, 1.51001, 1.09562, 0.786992, 0.58041]
X, Y = values_func[0], values_func[1]

t = linspace(0, 10, 31)
f = [func(x) for x in t]
plt.plot(t, f)
plt.plot(X, Y)
plt.scatter(iks, igrek)
plt.legend(["Истинная функция", "Интерполяция"])
